name: "pn_test"
platform: "pytorch_libtorch"
max_batch_size : 0
input [
  {
    name: "points"
    data_type: TYPE_FP32
    dims: [ -1, 2, -1 ]
  },
  {
    name: "features"
    data_type: TYPE_FP32
    dims: [ -1, 5, -1 ]
  },
  {
    name: "mask"
    data_type: TYPE_FP32
    dims: [ -1, 1, -1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ -1, 2]
  }
]
